# --------------------------- Homework_6.1  ------------------------------------
"""
Виконав: Григорій Чернолуцький
Homework_8

Package Version
------- -------
pip 24.3.1

"""

from multilang_calendar import get_data


def main() -> None:
    # ------------------------  Демо календар ----------------------------
    print(get_data())


# --------------------------------- main module ----------------------------------------------
if __name__ == '__main__':
    main()

''' 
РЕЗУЛЬТАТ

['Mo', 'Di', 'Mi', 'Do', 'Fr', 'Sa', 'So']

'''
